{
  "b81ee613-ecac-4851-b9ab-fab0fb732c1d": {
    "id": "b81ee613-ecac-4851-b9ab-fab0fb732c1d",
    "timestamp": "2025-06-22T12:38:22.234483",
    "type": "class",
    "plantuml_code": "@startuml\nclass System {\n+ displayLoginPage()\n+ acceptLoginCredentials()\n+ validateEnteredInformation()\n+ validateInformationAgainstDatabase()\n+ displayUserDetails()\n+ closePage()\n+ displayOkMessage()\n+ storeInDatabase()\n+ retrieveFromDatabase()\n+ askUserToLogin()\n+ displayCategoriesToBrowse()\n+ selectCategoryOfBooks()\n+ validateBooksInDatabase()\n+ retrieveBooksInCategory()\n+ selectDesiredBooks()\n+ displaySelectedBooksDetails()\n+ askUserToPrintDetails()\n+ reserveBookForMember()\n+ haveCorrectBookId()\n+ selectBookToReserve()\n+ acceptBookIdToReserve()\n+ validateBookId()\n+ askUserToSelectAnotherBook()\n+ searchBooks()\n+ selectCategoryForSearching()\n+ validateBookAvailability()\n+ issueBook()\n+ updateInformationInDatabase()\n+ haveBorrowedBooks()\n+ returnBook()\n+ acceptBookIdAndMemberId()\n+ promptUserForSuccessfulReturnMessage()\n+ viewMembers()\n+ removeBook()\n+ addOrRemoveBooksInDatabase()\n+ addMember()\n+ askAdministratorToAddOrRemoveMember()\n+ selectToAddMember()\n+ enterDetailsForNewMember()\n+ selectToRemoveMember()\n+ requireValidReasonForRemoval()\n+ validateInformationProvided()\n}\nclass User {\n+ clickLoginButton()\n+ clickConfirmButton()\n+ clickViewUserDetails()\n+ clickOnCategoryToBrowse()\n+ selectDesiredBook()\n+ printDetails()\n+ ignoreStep()\n}\nclass Member {\n+ loginToSystem()\n+ beLoggedIntoSystem()\n+ searchBooks()\n+ haveBorrowedBooks()\n+ returnsBook()\n+ beAvailableToRemove()\n}\nclass Guest {\n+ searchBooks()\n+ viewMembers()\n}\nclass Librarian {\n+ reserveBookForMember()\n+ issueBook()\n+ updateInformationInDatabase()\n+ beLoggedIntoSystem()\n}\nclass Administrator {\n+ validateInformationProvided()\n+ beLoggedIntoSystem()\nUser -- System\nMember -- System\nGuest -- System\nLibrarian -- System\nAdministrator -- System\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 10.11
    },
    "created_date": "2025-06-22T12:38:22.234483"
  },
  "998b0fef-9624-4ed5-836f-01820e236e34": {
    "id": "998b0fef-9624-4ed5-836f-01820e236e34",
    "timestamp": "2025-06-22T12:38:37.770211",
    "type": "class",
    "plantuml_code": "@startuml\nclass System {\n+ displayLoginPage()\n+ acceptLoginCredentials()\n+ validateEnteredInformation()\n+ validateInformationAgainstDatabase()\n+ login()\n+ displayUserDetails()\n+ closePage()\n+ displayOkMessage()\n+ storeInDatabase()\n+ retrieveFromDatabase()\n+ askUserToLogin()\n+ displayCategories()\n+ selectCategory()\n+ validateBooksInDatabase()\n+ retrieveBooksInCategory()\n+ selectDesiredBooks()\n+ displaySelectedBooksDetails()\n+ askUserToPrintDetails()\n+ reserveBookForMember()\n+ validateBookId()\n+ selectBookToReserve()\n+ acceptBookIdToReserve()\n+ validateSelectedBookAvailability()\n+ searchBooks()\n+ selectCategoryForSearch()\n+ validateBookAvailability()\n+ issueBook()\n+ updateDatabaseInformation()\n+ returnBook()\n+ acceptBookAndMemberIds()\n+ promptReturnMessage()\n+ viewMembers()\n+ addOrRemoveBooks()\n+ addOrRemoveMember()\n+ selectToAddMember()\n+ enterMemberDetails()\n+ selectToRemoveMember()\n+ requireValidRemovalReason()\n+ validateInformationProvided()\n}\nclass User {\n+ clickLoginButton()\n+ clickConfirmButton()\n+ clickViewUserDetails()\n+ clickPrintDetails()\n+ searchBooks()\n+ viewMembers()\n+ addOrRemoveBooks()\n+ addOrRemoveMember()\n}\nclass Member {\n+ loginToSystem()\n+ viewUserDetails()\n+ reserveBook()\n+ haveBorrowedBooks()\n+ returnBook()\n}\nclass Librarian {\n+ reserveBookForMember()\n+ issueBook()\n+ updateDatabaseInformation()\n}\nclass Administrator {\n+ addOrRemoveMember()\n+ validateInformationProvided()\n}\nclass Database {\n# storedData\nSystem \"1\" --> \"1\" Database\nUser \"1\" --> \"1\" System\nMember \"1\" --> \"1\" User\nLibrarian \"1\" --> \"1\" User\nAdministrator \"1\" --> \"1\" User\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 10.11
    },
    "created_date": "2025-06-22T12:38:37.770211"
  },
  "b8a11b89-6df5-4550-8949-1797a3172ad9": {
    "id": "b8a11b89-6df5-4550-8949-1797a3172ad9",
    "timestamp": "2025-06-22T12:38:56.236076",
    "type": "sequence",
    "plantuml_code": "@startuml\nactor administrator\nactor guest\nactor librarian\nactor member\nparticipant \"system\" as sys\nparticipant memberPage\nparticipant logInPage\nparticipant confirmButton\nparticipant database\nparticipant viewUserDetailsPage\nparticipant bookDetailsPage\nparticipant reserveBookPage\nparticipant issueBookPage\nparticipant returnBookPage\nparticipant addRemoveBookPage\nparticipant addRemoveMemberPage\nadministrator -> sys: Login\nsys -> member: Ask to click log-in button\nmember -> sys: Clicks log-in button\nsys -> member: Display log-in page\nmember -> sys: Enters login id and password\nsys -> member: Accepts login id with password\nmember -> sys: Clicks confirm button\nsys -> member: Validate required information\nalt Information is wrong\nsys -> member: Ask to re-enter details\nelse Information is correct\nsys -> database: Validate entered information\nsys -> member: Logged in to the system\nmember -> sys: Clicks view user details\nsys -> member: Display member details\nmember -> sys: Close page\nsys -> member: Display ok message\nend\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\nmember -> sys: Clicks on view user details\nsys -> member: Display user details\nmember -> sys: Close page\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 10.11
    },
    "created_date": "2025-06-22T12:38:56.236076"
  },
  "484c3cc0-98a1-4f64-88e2-d8dc12a07c3d": {
    "id": "484c3cc0-98a1-4f64-88e2-d8dc12a07c3d",
    "timestamp": "2025-06-22T12:39:28.324591",
    "type": "class",
    "plantuml_code": "@startuml\nclass System {\n+ displayLoginPage()\n+ acceptLoginCredentials(loginId: String, password: String)\n+ validateEnteredInformation()\n+ validateInformationAgainstDatabase()\n+ displayMemberDetails()\n+ closePage()\n+ displayOkMessage()\n+ storeInDatabase()\n+ retrieveFromDatabase()\n+ askUserToLogin()\n+ displayCategories()\n+ selectCategory(category: String)\n+ validateBooksInDatabase()\n+ retrieveBooksInCategory()\n+ selectDesiredBooks()\n+ displaySelectedBookDetails()\n+ askUserToPrintDetails()\n+ reserveBookForMember(bookId: String)\n+ validateBookId(bookId: String)\n+ checkBookAvailability()\n+ issueBook()\n+ updateDatabaseInformation()\n+ returnBook(bookId: String, memberId: String)\n+ promptReturnMessage(bookId: String)\n+ viewMembers()\n+ addOrRemoveBooks()\n+ addOrRemoveMember()\n+ validateInformation()\n}\nclass User {\n+ login()\n+ viewUserDetails()\n+ selectCategory(category: String)\n+ searchBook()\n+ borrowBook()\n+ returnBook()\n}\nclass Member {\n+ login()\n+ viewUserDetails()\n+ borrowBook()\n+ returnBook()\n}\nclass Librarian {\n+ reserveBook()\n+ issueBook()\n+ addBook()\n+ removeBook()\n}\nclass Administrator {\n+ addOrRemoveMember()\n+ validateInformation()\nclass Database {\n+ storeData()\n+ retrieveData()\n}\nSystem \"1\" -- \"1..*\" User\nSystem \"1\" -- \"1..*\" Database\nSystem \"1\" -- \"1..*\" Librarian\nSystem \"1\" -- \"1..*\" Administrator\nUser \"1\" -- \"1..*\" Member\nLibrarian \"1\" -- \"1..*\" Member\nAdministrator \"1\" -- \"1..*\" Member\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 10.11
    },
    "created_date": "2025-06-22T12:39:28.324591"
  },
  "e74ab1e6-2e6f-4ad9-ad25-c6ec84682742": {
    "id": "e74ab1e6-2e6f-4ad9-ad25-c6ec84682742",
    "timestamp": "2025-06-22T16:50:46.621473",
    "type": "class",
    "plantuml_code": "@startuml\nclass System {\n+ displayLoginPage()\n+ acceptLoginCredentials()\n+ validateEnteredInformation()\n+ validateInformationAgainstDatabase()\n+ displayUserDetails()\n+ closePage()\n+ displayOkMessage()\n+ storeInDatabase()\n+ retrieveFromDatabase()\n+ askUserToLogin()\n+ displayCategories()\n+ selectCategory()\n+ validateBooksInDatabase()\n+ retrieveBooksByCategory()\n+ selectDesiredBooks()\n+ displaySelectedBookDetails()\n+ askUserToPrintDetails()\n+ reserveBookForMember()\n+ validateBookId()\n+ selectBookToReserve()\n+ acceptBookIdToReserve()\n+ validateBookAvailability()\n+ issueBook()\n+ updateDatabaseInformation()\n+ returnBook()\n+ acceptBookAndMemberId()\n+ viewMembers()\n+ addOrRemoveBooks()\n+ addBook()\n+ enterBookDetails()\n+ removeBook()\n+ validateInformationProvided()\n+ addOrRemoveMember()\n+ selectToAddMember()\n+ enterMemberDetails()\n+ selectToRemoveMember()\n+ requireValidRemovalReason()\n+ validateInformationCorrectness()\n}\nclass User {\n+ clickLoginButton()\n+ clickConfirmButton()\n+ clickViewUserDetails()\n+ clickOnCategory()\n+ searchBook()\n+ borrowBooks()\n+ returnsBook()\n}\nclass Member {\n+ logIn()\n+ viewUserDetails()\n+ searchBooks()\n+ haveBorrowedBooks()\n+ addOrRemoveMember()\n}\nclass Librarian {\n+ reserveBook()\n+ issueBook()\n+ addOrRemoveBooks()\n}\nclass Guest {\n+ searchBooks()\n+ viewMembers()\n}\nclass Administrator {\n+ addOrRemoveMember()\n+ validateInformationProvided()\n}\nUser -- System\nMember -- System\nLibrarian -- System\nGuest -- System\nAdministrator -- System\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 7.36
    },
    "created_date": "2025-06-22T16:50:46.621473"
  },
  "0d12fb03-7006-4902-9b53-015234ed4513": {
    "id": "0d12fb03-7006-4902-9b53-015234ed4513",
    "timestamp": "2025-06-22T16:51:30.256447",
    "type": "class",
    "plantuml_code": "@startuml\nclass System {\n+ displayLoginPage()\n+ acceptLoginCredentials()\n+ validateEnteredInformation()\n+ validateEnteredInformationAgainstDatabase()\n+ validateBooksInDatabase()\n+ retrieveBooksByCategory()\n+ displayBookDetails()\n+ printBookDetails()\n+ reserveBook()\n+ validateBookId()\n+ issueBook()\n+ updateDatabaseInformation()\n+ returnBook()\n+ viewMembers()\n+ addOrRemoveBooks()\n+ addOrRemoveMember()\n+ validateInformation()\n}\nclass User {\n+ clickLoginButton()\n+ clickConfirmButton()\n+ clickViewUserDetails()\n+ clickCategoryToBrowse()\n+ selectCategoryOfBooks()\n+ selectDesiredBooks()\n+ selectBookToReserve()\n+ searchBooks()\n+ borrowBooks()\n+ returnsBook()\n}\nclass Member {\n+ loginToSystem()\n+ viewUserDetails()\n+ beLoggedIntoSystem()\n+ haveBorrowedBooks()\n+ removeMember()\n}\nclass Guest {\n+ searchBooks()\n+ viewMembers()\n}\nclass Librarian {\n+ reserveBookForMember()\n+ issueBook()\n+ cannotIssueBooksIfThreeIssued()\n+ beLoggedIntoSystem()\n}\nclass Administrator {\n+ beLoggedIntoSystem()\n}\nSystem \"1\" -- \"1\" User\nSystem \"1\" -- \"1\" Member\nSystem \"1\" -- \"1\" Guest\nSystem \"1\" -- \"1\" Librarian\nSystem \"1\" -- \"1\" Administrator\nMember --|> User\nLibrarian --|> User\nAdministrator --|> User\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 7.36
    },
    "created_date": "2025-06-22T16:51:30.256447"
  },
  "13cca35a-7463-447a-9435-864a494525b1": {
    "id": "13cca35a-7463-447a-9435-864a494525b1",
    "timestamp": "2025-06-22T16:51:53.042444",
    "type": "sequence",
    "plantuml_code": "@startuml\nactor administrator\nactor guest\nactor librarian\nactor member\nparticipant system\ntitle System Interaction Sequence Diagram\nparticipant member\nparticipant system\nmember -> system: Click log-in button on home page\nsystem -> system: Display log-in page\nmember -> system: Enter login id and password\nmember -> system: Click confirm button\nsystem -> system: Validate required information\nalt entered information is wrong\nsystem -> system: Ask member to reenter details\nelse entered information is correct\nsystem -> system: Validate entered information against database\nsystem -> system: Log member into the system\nmember -> system: Click on view user details\nsystem -> system: Display member details\nmember -> system: Close page\nsystem -> system: Display ok message\nsystem -> system: Store information in database\nsystem -> system: Retrieve information\nend\nmember -> system: Click on view user details\nsystem -> system: Display member details\nmember -> system: Close page\nsystem -> system: Display ok message\nsystem -> system: Store information in database\nsystem -> system: Retrieve information\nmember -> system: Click on view user details\nsystem -> system: Display member details\nmember -> system: Close page\nsystem -> system: Display ok message\nsystem -> system: Store information in database\nsystem -> system: Retrieve information\nmember -> system: Click on view user details\nsystem -> system: Display member details\nmember -> system: Close page\nsystem -> system: Display ok message\nsystem -> system: Store information in database\nsystem -> system: Retrieve information\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 7.36
    },
    "created_date": "2025-06-22T16:51:53.042444"
  },
  "b28f74ca-7211-4e57-9d2d-ff6bc825d144": {
    "id": "b28f74ca-7211-4e57-9d2d-ff6bc825d144",
    "timestamp": "2025-06-22T17:21:48.358830",
    "type": "class",
    "plantuml_code": "@startuml\nclass System {\n+ displayLoginPage()\n+ acceptLoginCredentials()\n+ validateEnteredInformation()\n+ validateEnteredInformationAgainstDatabase()\n+ beLoggedIn()\n+ displayUserDetails()\n+ closePage()\n+ displayOkMessage()\n+ storeInDatabase()\n+ retrieveFromDatabase()\n+ askUserToLogin()\n+ displayCategoriesToBrowse()\n+ selectCategoryOfBooks()\n+ validateBooksInDatabase()\n+ retrieveBooksInCategory()\n+ selectDesiredBooks()\n+ displaySelectedBooksDetails()\n+ askUserToPrintDetails()\n+ reserveBookForMember()\n+ haveCorrectBookId()\n+ selectBookToReserve()\n+ acceptBookIdToReserve()\n+ validateBookId()\n+ askUserToSelectAnotherBook()\n+ beLoggedIntoSystem()\n+ searchBooks()\n+ selectCategoryForSearchingBook()\n+ validateBookAvailability()\n+ issueBook()\n+ updateInformationInDatabase()\n+ haveBorrowedBooks()\n+ returnBook()\n+ acceptBookIdAndMemberId()\n+ promptUserForSuccessfulReturnMessage()\n+ viewMembers()\n+ removeBook()\n+ addOrRemoveBooksInDatabase()\n+ addBook()\n+ enterNewBookDetails()\n+ removeBookIfOutdated()\n+ validateProvidedInformation()\n}\nclass User {\n+ clickLoginButton()\n+ clickConfirmButton()\n+ clickViewUserDetails()\n+ clickOnCategoryToBrowse()\n+ clickSelectBookToView()\n+ clickPrintDetails()\n+ clickIgnoreStep()\n+ searchBooks()\n+ viewMembers()\n+ addOrRemoveMember()\n}\nclass Member {\n+ beLoggedIn()\n+ haveBorrowedBooks()\n+ returnsBook()\n}\nclass Administrator {\n+ beLoggedIn()\n+ validateProvidedInformation()\n}\nclass Librarian {\n+ reserveBookForMember()\n+ issueBook()\n+ updateInformationInDatabase()\n}\nclass Guest {\n+ searchBooks()\n+ viewMembers()\n}\nSystem -- User\nSystem -- Member\nSystem -- Administrator\nSystem -- Librarian\nSystem -- Guest\nUser -- Member\nUser -- Administrator\nUser -- Guest\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 2.08
    },
    "created_date": "2025-06-22T17:21:48.358830"
  },
  "5ace45cc-6e2f-4547-9642-1ac5b8a774e5": {
    "id": "5ace45cc-6e2f-4547-9642-1ac5b8a774e5",
    "timestamp": "2025-06-22T17:34:52.155394",
    "type": "sequence",
    "plantuml_code": "@startuml\nactor administrator\nactor guest\nactor librarian\nactor member\nparticipant \"system\" as sys\nparticipant memberPage\nparticipant loginPage\nparticipant database\nparticipant bookDetailsPage\nactivate member\nmember -> sys: click log-in button\nsys -> member: display log-in page\nmember -> sys: enter login id and password\nmember -> sys: click confirm button\nsys -> member: validate required information\nalt information is wrong\nsys -> member: ask to reenter details\nelse information is correct\nsys -> database: validate entered information\ndatabase --> sys: information validated\nsys -> member: logged in to the system\nend\nmember -> sys: click view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\nmember -> sys: click on view user details\nsys -> member: display member details\nmember -> sys: close page\nsys -> member: display ok message\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 2.08
    },
    "created_date": "2025-06-22T17:34:52.155394"
  },
  "c9f04d45-2725-44ed-b4c5-d21093e0bfcb": {
    "id": "c9f04d45-2725-44ed-b4c5-d21093e0bfcb",
    "timestamp": "2025-06-22T17:34:53.727954",
    "type": "sequence",
    "plantuml_code": "@startuml\nactor administrator\nactor guest\nactor librarian\nactor member\nparticipant \"system\" as sys\nadministrator -> sys: log-in button on home page\nsys -> administrator: display log-in page\nadministrator -> sys: enter login id and password\nsys -> administrator: click confirm button\nadministrator -> sys: view user details\nsys -> administrator: display member details\nadministrator -> sys: close page\nsys -> administrator: display ok message\nguest -> sys: login\nsys -> guest: ask user to login\nguest -> sys: browse categories\nsys -> guest: display categories\nguest -> sys: select category of books\nsys -> guest: validate selected category\nguest -> sys: select desired books\nsys -> guest: display details of selected books\nguest -> sys: print details\nsys -> guest: ask user to print details\nguest -> sys: ignore print step\nlibrarian -> sys: reserve a book for member\nsys -> librarian: login\nlibrarian -> sys: select book to reserve\nsys -> librarian: validate book selection\nlibrarian -> sys: enter book id to reserve\nsys -> librarian: validate book id\nlibrarian -> sys: check book availability\nsys -> librarian: issue book\nmember -> sys: login\nsys -> member: ask user to login\nmember -> sys: search books\nsys -> member: display available books\nmember -> sys: select category for searching a book\nsys -> member: validate selected category\nmember -> sys: view members\nlibrarian -> sys: issue book\nsys -> librarian: validate book availability\nlibrarian -> sys: update database\nlibrarian -> sys: return book\nsys -> librarian: accept book id and member id\nlibrarian -> sys: prompt book return message\nsys -> librarian: store return in database\nadministrator -> sys: add or remove books\nsys -> administrator: add or remove books in database\nadministrator -> sys: add a book\nsys -> administrator: enter details of new book\nadministrator -> sys: remove a book\nsys -> administrator: provide reason for removal\nadministrator -> sys: add or remove member\nsys -> administrator: add or remove member in database\nadministrator -> sys: add a member\nsys -> administrator: enter details of new member\nadministrator -> sys: remove a member\nsys -> administrator: provide reason for removal\n@enduml",
    "snl_data": {
      "snl_text": "The system shall provide member with the ability to the click the log-in button on the home page..\nThe system shall be able to display the log- in page..\nThe system shall be able to accept his login id with password..\nThe system shall provide member with the ability to the click on the confirm button..\nThe system shall be able to validate that all of the required information was entered..\nIf the entered information is wrong, then the system shall asks member to reenter the details..\nThe system shall be able to accept ed information is wrong.\nThe system shall be able to ask member to reenter the details..\nThe system shall be able to validate the entered information against the tables stored in the database..\nThe system shall provide member with the ability to be logged in to the system..\nThe system shall provide member with the ability to the click on view user details..\nThe system shall be able to display the details of the member..\nThe system shall be able to close the page..\nThe system shall be able to display the ok message..\nThe system shall be able to store d in database..\nThe system shall be able to retrieve ..\nThe system shall be able to ask user to login..\nIf the system identies the type of user- member, then the system shall guest or administrator..\nThe system shall be able to display the categories to browse..\nThe system shall be able to selects a category of books to view..\nIf no category is selected by the user, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the user.\nThe system shall be able to ask user to select a category..\nThe system shall be able to validate the books in the database..\nThe system shall be able to retrieve all the books falling in that category..\nThe system shall be able to selects the desired books..\nThe system shall be able to display the details of the selected books..\nThe system shall be able to ask user to print the details..\nIf user does not want to print the details, then the system shall user can ignore the step..\nThe system shall provide user with the ability to the does not want to print the details.\nThe system shall provide user with the ability to ignore the step..\nThe system shall provide librarian with the ability to also reserve a book for a member..\nThe system shall provide user with the ability to be logged into the system..\nThe system shall provide user with the ability to have correct book id..\nThe system shall be available to reserve..\nThe system shall be able to selects book to reserve..\nIf no book is selected by the user, then the system shall again asks user to select a book to reserve..\nThe system shall be able to if no book is selected by the user.\nThe system shall be able to ask user to select a book to reserve..\nThe system shall be able to accept book id to reserve..\nIf the book id is wrong, then the system shall asks user to recheck the book id..\nThe system shall be able to if the book id is wrong.\nThe system shall be able to validate the book id..\nIf the selected book is already reserved on another id, then the system shall asks user to select another book..\nThe system shall be able to if the selected book is already reserved on another id.\nThe system shall be able to ask user to select another book..\nThe system shall provide member with the ability to s should be logged into the system..\nThe system shall provide guest with the ability to the user can also search books..\nThe system shall provide users with the ability to book should be available to search..\nThe system shall be able to selects a category of searching a book..\nIf no category is selected by the member, then the system shall again asks user to select a category..\nThe system shall be able to if no category is selected by the member.\nThe system shall provide librarian with the ability to ..\nThe system shall be available to issue..\nThe system shall be able to validate the availability of the books..\nThe system shall provide librarian with the ability to issues the book..\nThe system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\nThe system shall be able to update the information in database..\nThe system shall provide librarian with the ability to be logged into the system..\nThe system shall provide member with the ability to the have borrowed books..\nThe system shall provide member with the ability to returns the book..\nThe system shall be able to accept book id , member id in the system..\nIf the entered book id is incorrect, then the system shall asks to re-enter the book id..\nThe system shall be able to accept ed book id is incorrect.\nThe system shall be able to ask to re-enter the book id..\nThe system shall be able to prompt the user to a message that the book with book id is successfully returned..\nThe system shall be able to store d in the database..\nThe system shall be able to retrieve by the system..\nThe system shall provide guest with the ability to also view members..\nThe system shall provide member with the ability to s..\nThe system shall be available to remove..\nThe system shall be available to add or remove books in the database..\nThe system shall provide librarian with the ability to has option of adding or removing a book in database..\nThe system shall be able to ask librarian to add or remove the book..\nThe system shall provide librarian with the ability to adds a book..\nThe system shall be able to ask librarian to enter all the required details about the new book to be added..\nThe system shall be able to accept the details..\nIf the librarian selects to remove a book, then the system shall the book should be outdated..\nThe system shall be able to if the librarian selects to remove a book.\nThe system shall be outdated..\nThe system shall provide administrator with the ability to the that all the information has been correctly provided..\nThe system shall provide administrator with the ability to be logged into the system..\nThe system shall provide member with the ability to be available to remove..\nThe system shall provide member with the ability to the details should be available to add or remove member in the database..\nThe system shall be able to ask administrator to add or remove a member..\nThe system shall be able to selects to add a member..\nThe system shall be able to ask administrator to enter all the required details about the new member to be added..\nIf the administrator selects to remove a member, then the system shall a valid reason of removal is required..\nThe system shall be able to if the administrator selects to remove a member.\nThe system shall ensure that a valid reason of removal is required..\nThe system shall be able to validate that all the information has been correctly provided..",
      "actors": [
        "administrator",
        "guest",
        "librarian",
        "member",
        "system",
        "user"
      ],
      "preprocessed_text": "the member clicks the log-in button on the home page. the system displays the log- in page. the member enters his login id with password. the member clicks on the confirm button. the system checks that all of the required information was entered. if the entered information is wrong then system asks member to reenter the details. the system validates the entered information against the tables stored in the database. member must be logged in to the system. the member clicks on view user details. the system opens a page showing the details of the member. the details include the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. the system shows ok message. the books should be stored in database. the books must be ready to retrieve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects a category of books to view. if no category is selected by the user then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. the user selects the desired books. the system shows the details of the selected books. the system asks user to print the details. if user does not want to print the details then user can ignore the step. user can reserve a book by inputting the relevant details and the librarian can also reserve a book for a member. user should be logged into the system. user should have correct book id. books should be available to reserve. the system asks user to login. the system identifies the type of user- member, guest or administrator. the system shows the categories to browse. the user selects book to reserve. if no book is selected by the user then the system again asks user to select a book to reserve. the user enters book id to reserve. if the book id is wrong then system asks user to recheck the book id. the system checks the books in the database. if the selected book is already reserved on another id then system asks user to select another book. members should be logged into the system. guest user can also search books. book should be available to search. the system shows the categories to browse. the member selects a category of searching a book. if no category is selected by the member then the system again asks user to select a category. the system checks the books in the database. the system retrieves all the books falling in that category. member should give the member id to the librarian. books should be available to issue. the librarian checks the availability of the books. the librarian also checks total number of books issued on that id. librarian issues the book. the librarian cannot issue the books if the user has three books issued on his id. the system updates the information in database. librarian should be logged into the system. member should have borrowed books. member should give the member id to the librarian. the member returns the book. the librarian enters book id , member id in the system. if the entered book id is incorrect then system asks to re-enter the book id. the system prompts a message that the book with book id is successfully returned. members should be stored in the database. members should be available to retrieve by the system. member must be logged in to the system. guest can also view members. the user clicks on view members. the system opens a page showing the details of the member. the details include name of member, the total number of issued books, date of issue, return date, fine to be paid. the member closes the page. librarian should be logged into the system. books should be available to remove. book details should be available to add or remove books in the database. the librarian has option of adding or removing a book in database. the system asks librarian to add or remove the book. the librarian adds a book. the system asks librarian to enter all the required details about the new book to be added. the librarian enters the details. if the librarian selects to remove a book then the book should be outdated. the system administrator that all the information has been correctly provided. administrator should be logged into the system. member should be available to remove. member details should be available to add or remove member in the database. the system asks administrator to add or remove a member. the administrator selects to add a member. the system asks administrator to enter all the required details about the new member to be added. the administrator enters the details. if the administrator selects to remove a member then a valid reason of removal is required. the system validates that all the information has been correctly provided.",
      "sentences_count": 91,
      "formatted_sentences": "1. The system shall provide member with the ability to the click the log-in button on the home page..\n2. The system shall be able to display the log- in page..\n3. The system shall be able to accept his login id with password..\n4. The system shall provide member with the ability to the click on the confirm button..\n5. The system shall be able to validate that all of the required information was entered..\n6. If the entered information is wrong, then the system shall asks member to reenter the details..\n7. The system shall be able to accept ed information is wrong.\n8. The system shall be able to ask member to reenter the details..\n9. The system shall be able to validate the entered information against the tables stored in the database..\n10. The system shall provide member with the ability to be logged in to the system..\n11. The system shall provide member with the ability to the click on view user details..\n12. The system shall be able to display the details of the member..\n13. The system shall be able to close the page..\n14. The system shall be able to display the ok message..\n15. The system shall be able to store d in database..\n16. The system shall be able to retrieve ..\n17. The system shall be able to ask user to login..\n18. If the system identies the type of user- member, then the system shall guest or administrator..\n19. The system shall be able to display the categories to browse..\n20. The system shall be able to selects a category of books to view..\n21. If no category is selected by the user, then the system shall again asks user to select a category..\n22. The system shall be able to if no category is selected by the user.\n23. The system shall be able to ask user to select a category..\n24. The system shall be able to validate the books in the database..\n25. The system shall be able to retrieve all the books falling in that category..\n26. The system shall be able to selects the desired books..\n27. The system shall be able to display the details of the selected books..\n28. The system shall be able to ask user to print the details..\n29. If user does not want to print the details, then the system shall user can ignore the step..\n30. The system shall provide user with the ability to the does not want to print the details.\n31. The system shall provide user with the ability to ignore the step..\n32. The system shall provide librarian with the ability to also reserve a book for a member..\n33. The system shall provide user with the ability to be logged into the system..\n34. The system shall provide user with the ability to have correct book id..\n35. The system shall be available to reserve..\n36. The system shall be able to selects book to reserve..\n37. If no book is selected by the user, then the system shall again asks user to select a book to reserve..\n38. The system shall be able to if no book is selected by the user.\n39. The system shall be able to ask user to select a book to reserve..\n40. The system shall be able to accept book id to reserve..\n41. If the book id is wrong, then the system shall asks user to recheck the book id..\n42. The system shall be able to if the book id is wrong.\n43. The system shall be able to validate the book id..\n44. If the selected book is already reserved on another id, then the system shall asks user to select another book..\n45. The system shall be able to if the selected book is already reserved on another id.\n46. The system shall be able to ask user to select another book..\n47. The system shall provide member with the ability to s should be logged into the system..\n48. The system shall provide guest with the ability to the user can also search books..\n49. The system shall provide users with the ability to book should be available to search..\n50. The system shall be able to selects a category of searching a book..\n51. If no category is selected by the member, then the system shall again asks user to select a category..\n52. The system shall be able to if no category is selected by the member.\n53. The system shall provide librarian with the ability to ..\n54. The system shall be available to issue..\n55. The system shall be able to validate the availability of the books..\n56. The system shall provide librarian with the ability to issues the book..\n57. The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..\n58. The system shall be able to update the information in database..\n59. The system shall provide librarian with the ability to be logged into the system..\n60. The system shall provide member with the ability to the have borrowed books..\n61. The system shall provide member with the ability to returns the book..\n62. The system shall be able to accept book id , member id in the system..\n63. If the entered book id is incorrect, then the system shall asks to re-enter the book id..\n64. The system shall be able to accept ed book id is incorrect.\n65. The system shall be able to ask to re-enter the book id..\n66. The system shall be able to prompt the user to a message that the book with book id is successfully returned..\n67. The system shall be able to store d in the database..\n68. The system shall be able to retrieve by the system..\n69. The system shall provide guest with the ability to also view members..\n70. The system shall provide member with the ability to s..\n71. The system shall be available to remove..\n72. The system shall be available to add or remove books in the database..\n73. The system shall provide librarian with the ability to has option of adding or removing a book in database..\n74. The system shall be able to ask librarian to add or remove the book..\n75. The system shall provide librarian with the ability to adds a book..\n76. The system shall be able to ask librarian to enter all the required details about the new book to be added..\n77. The system shall be able to accept the details..\n78. If the librarian selects to remove a book, then the system shall the book should be outdated..\n79. The system shall be able to if the librarian selects to remove a book.\n80. The system shall be outdated..\n81. The system shall provide administrator with the ability to the that all the information has been correctly provided..\n82. The system shall provide administrator with the ability to be logged into the system..\n83. The system shall provide member with the ability to be available to remove..\n84. The system shall provide member with the ability to the details should be available to add or remove member in the database..\n85. The system shall be able to ask administrator to add or remove a member..\n86. The system shall be able to selects to add a member..\n87. The system shall be able to ask administrator to enter all the required details about the new member to be added..\n88. If the administrator selects to remove a member, then the system shall a valid reason of removal is required..\n89. The system shall be able to if the administrator selects to remove a member.\n90. The system shall ensure that a valid reason of removal is required..\n91. The system shall be able to validate that all the information has been correctly provided..",
      "requirements": [
        "The system shall provide member with the ability to the click the log-in button on the home page..",
        "The system shall be able to display the log- in page..",
        "The system shall be able to accept his login id with password..",
        "The system shall provide member with the ability to the click on the confirm button..",
        "The system shall be able to validate that all of the required information was entered..",
        "If the entered information is wrong, then the system shall asks member to reenter the details..",
        "The system shall be able to accept ed information is wrong.",
        "The system shall be able to ask member to reenter the details..",
        "The system shall be able to validate the entered information against the tables stored in the database..",
        "The system shall provide member with the ability to be logged in to the system..",
        "The system shall provide member with the ability to the click on view user details..",
        "The system shall be able to display the details of the member..",
        "The system shall be able to close the page..",
        "The system shall be able to display the ok message..",
        "The system shall be able to store d in database..",
        "The system shall be able to retrieve ..",
        "The system shall be able to ask user to login..",
        "If the system identies the type of user- member, then the system shall guest or administrator..",
        "The system shall be able to display the categories to browse..",
        "The system shall be able to selects a category of books to view..",
        "If no category is selected by the user, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the user.",
        "The system shall be able to ask user to select a category..",
        "The system shall be able to validate the books in the database..",
        "The system shall be able to retrieve all the books falling in that category..",
        "The system shall be able to selects the desired books..",
        "The system shall be able to display the details of the selected books..",
        "The system shall be able to ask user to print the details..",
        "If user does not want to print the details, then the system shall user can ignore the step..",
        "The system shall provide user with the ability to the does not want to print the details.",
        "The system shall provide user with the ability to ignore the step..",
        "The system shall provide librarian with the ability to also reserve a book for a member..",
        "The system shall provide user with the ability to be logged into the system..",
        "The system shall provide user with the ability to have correct book id..",
        "The system shall be available to reserve..",
        "The system shall be able to selects book to reserve..",
        "If no book is selected by the user, then the system shall again asks user to select a book to reserve..",
        "The system shall be able to if no book is selected by the user.",
        "The system shall be able to ask user to select a book to reserve..",
        "The system shall be able to accept book id to reserve..",
        "If the book id is wrong, then the system shall asks user to recheck the book id..",
        "The system shall be able to if the book id is wrong.",
        "The system shall be able to validate the book id..",
        "If the selected book is already reserved on another id, then the system shall asks user to select another book..",
        "The system shall be able to if the selected book is already reserved on another id.",
        "The system shall be able to ask user to select another book..",
        "The system shall provide member with the ability to s should be logged into the system..",
        "The system shall provide guest with the ability to the user can also search books..",
        "The system shall provide users with the ability to book should be available to search..",
        "The system shall be able to selects a category of searching a book..",
        "If no category is selected by the member, then the system shall again asks user to select a category..",
        "The system shall be able to if no category is selected by the member.",
        "The system shall provide librarian with the ability to ..",
        "The system shall be available to issue..",
        "The system shall be able to validate the availability of the books..",
        "The system shall provide librarian with the ability to issues the book..",
        "The system shall provide librarian with the ability to the cannot issue the books if the user has three books issued on his id..",
        "The system shall be able to update the information in database..",
        "The system shall provide librarian with the ability to be logged into the system..",
        "The system shall provide member with the ability to the have borrowed books..",
        "The system shall provide member with the ability to returns the book..",
        "The system shall be able to accept book id , member id in the system..",
        "If the entered book id is incorrect, then the system shall asks to re-enter the book id..",
        "The system shall be able to accept ed book id is incorrect.",
        "The system shall be able to ask to re-enter the book id..",
        "The system shall be able to prompt the user to a message that the book with book id is successfully returned..",
        "The system shall be able to store d in the database..",
        "The system shall be able to retrieve by the system..",
        "The system shall provide guest with the ability to also view members..",
        "The system shall provide member with the ability to s..",
        "The system shall be available to remove..",
        "The system shall be available to add or remove books in the database..",
        "The system shall provide librarian with the ability to has option of adding or removing a book in database..",
        "The system shall be able to ask librarian to add or remove the book..",
        "The system shall provide librarian with the ability to adds a book..",
        "The system shall be able to ask librarian to enter all the required details about the new book to be added..",
        "The system shall be able to accept the details..",
        "If the librarian selects to remove a book, then the system shall the book should be outdated..",
        "The system shall be able to if the librarian selects to remove a book.",
        "The system shall be outdated..",
        "The system shall provide administrator with the ability to the that all the information has been correctly provided..",
        "The system shall provide administrator with the ability to be logged into the system..",
        "The system shall provide member with the ability to be available to remove..",
        "The system shall provide member with the ability to the details should be available to add or remove member in the database..",
        "The system shall be able to ask administrator to add or remove a member..",
        "The system shall be able to selects to add a member..",
        "The system shall be able to ask administrator to enter all the required details about the new member to be added..",
        "If the administrator selects to remove a member, then the system shall a valid reason of removal is required..",
        "The system shall be able to if the administrator selects to remove a member.",
        "The system shall ensure that a valid reason of removal is required..",
        "The system shall be able to validate that all the information has been correctly provided.."
      ],
      "original_sentences_processed": 92,
      "processing_stats": {
        "total_input_sentences": 92,
        "requirements_generated": 92,
        "unique_requirements": 91,
        "actors_identified": 6
      },
      "processing_time": 2.08
    },
    "created_date": "2025-06-22T17:34:53.727954"
  }
}